# ContentDelivery Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePanes..::..BuiltInDockablePanes..::..ContentDelivery Property
DockablePanes..::..BuiltInDockablePanes Class See Also
---
The content delivery pane.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static DockablePaneId ContentDelivery { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContentDelivery As DockablePaneId
	Get
```

Visual C++
---
```text
public:
static property DockablePaneId^ ContentDelivery {
	DockablePaneId^ get ();
}
```

# See Also
DockablePanes..::..BuiltInDockablePanes Class
Autodesk.Revit.UI Namespace